#!/bin/bash
#set -x
#==================================================================================================
# 環境構築
#==================================================================================================
#--------------------------------------------------------------------------------------------------
# 環境設定
#--------------------------------------------------------------------------------------------------
# カレントディレクトリの移動
cd $(cd $(dirname $0); pwd)

DIR_BASE=$(cd ..; pwd)

# 共通設定
readonly DIR_BASE=$(cd ..; pwd)
. ./setenv.sh


#--------------------------------------------------------------------------------------------------
# パーミッション設定
#--------------------------------------------------------------------------------------------------
# shell
#echo "- set permittion - shell"
#for cur_filepath in `find ${DIR_BASE} -follow -type f -name \*.sh`; do
#  echo "-- chmod 755 ${cur_filepath}"
#  chmod 755 ${cur_filepath}
#done


#--------------------------------------------------------------------------------------------------
# 不要ファイルの削除
#--------------------------------------------------------------------------------------------------
# .gitkeep
echo "- remove - .gitkeep"
for cur_filepath in `find ${DIR_BASE} -follow -type f -name '.gitkeep'`; do
  echo "-- rm -f ${cur_filepath}"
  rm -f ${cur_filepath}
done


#--------------------------------------------------------------------------------------------------
# OS依存バイナリファイル準備
#--------------------------------------------------------------------------------------------------
echo "- binary file setup"
if [ $(is_mac) = "true" ]; then
  find ${DIR_BIN_LIB}/binary/mac -type f                                                           |
  xargs -I {} bash -c 'cur_file_path={}; ln -s ${cur_file_path} $(cd $(dirname ${cur_file_path})/../..; pwd)/$(basename ${cur_file_path})'
else
  find ${DIR_BIN_LIB}/binary/linux -type f                                                         |
  xargs -I {} bash -c 'cur_file_path={}; ln -s ${cur_file_path} $(cd $(dirname ${cur_file_path})/../..; pwd)/$(basename ${cur_file_path})'
fi
