#!/bin/bash
#==================================================================================================
#
# 共通関数定義
# ※_で始まるfunctionは、パイプでの呼出しだけを想定しています。
#
#==================================================================================================
#--------------------------------------------------------------------------------------------------
# 実行OS判定
#--------------------------------------------------------------------------------------------------
function is_mac() {
  if [ "$(uname)" == 'Darwin' ]; then
    echo "true"
  else
    echo "false"
  fi
  return 0
}
function is_linux() {
  if [ "$(expr substr $(uname -s) 1 5)" == 'Linux' ]; then
    echo "true"
  else
    echo "false"
  fi
  return 0
}
function is_cygwin() {
  if [ "$(expr substr $(uname -s) 1 10)" == 'MINGW32_NT' ]; then
    echo "true"
  else
    echo "false"
  fi
  return 0
}

#--------------------------------------------------------------------------------------------------
# 文字列操作
#--------------------------------------------------------------------------------------------------
function _trim() {
  cat -                                                                                            | # 標準入力から
  sed -e "s|^  *||g"                                                                               | # leftトリム
  sed -e "s|  *$||g"                                                                                 # rightトリム
  return 0
}
function _ltrim() {
  cat -                                                                                            | # 標準入力から
  sed -e "s|^  *||g"                                                                                 # leftトリム
  return 0
}
function _rtrim() {
  cat -                                                                                            | # 標準入力から
  sed -e "s|  *$||g"                                                                                 # rightトリム
  return 0
}
function _sp_multi2single() {
  cat -                                                                                            | # 標準入力から
  sed -E "s| +| |g"                                                                                  # 複数スペースを単一に置換
  return 0
}

#--------------------------------------------------------------------------------------------------
# 行操作
#--------------------------------------------------------------------------------------------------
function _except_comment_row() {
  cat -                                                                                            | # 標準入力から
  grep -v '^\s*#'                                                                                    # コメント行を除外
  return 0
}
function _except_empty_row() {
  cat -                                                                                            | # 標準入力から
  grep -v '^\s*$'                                                                                    # 空行を除外
  return 0
}
